---
kind: type
id: T:Autodesk.Revit.DB.DimensionStyleType
source: html/130b0264-615d-610e-38e0-4ce2a8e2aecd.htm
---
# Autodesk.Revit.DB.DimensionStyleType

An enumerated type containing possible style types of dimensions.

## Syntax (C#)
```csharp
public enum DimensionStyleType
```